using System;
using System.Collections.Generic;

namespace WeatherApp
{ 
    public class ИнформацияDatabase
    {
        internal List<Информация> Информация { get; private set; }

        public void Initialize()
        {
            Информация = new List<Информация>
            {
                new Информация(20, дисциплина.Английский, new преподаватель("Шушерина Ольга Валерьевна")),
                new Информация(10, дисциплина.Философия, new преподаватель("Минор Олеся Вячеславовна")),
                new Информация(34, дисциплина.Физвоспитание, new преподаватель("Пятак Сергей Васильевич")),
                new Информация(1, дисциплина.МДК01, new преподаватель("Черкашин Дмитрий Сергеевич")),
                new Информация(44, дисциплина.МДК02, new преподаватель("Моисеев Владимир Иванович")),
            };
        }
    }
}